# Preliminaries

In [2]:
#Import libraries
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn
%matplotlib inline

In [21]:
#Import data
train=pd.read_csv('titanic-data/train.csv')
test=pd.read_csv('titanic-data/test.csv')

# Part 1: Exploratory Data Analysis

In [47]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
train=train.set_index('PassengerId')

In [48]:
train.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [44]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [53]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [49]:
print(train.groupby('Sex')[['Survived']].sum())

        Survived
Sex
female       233
male         109

In [60]:
print(train.groupby(['Sex','Pclass'])[['Survived']].count().unstack())

       Survived
Pclass        1    2    3
Sex
female       94   76  144
male        122  108  347

In [78]:
print(train.groupby(['SibSp','Sex'])[['Survived']].mean().unstack())

       Survived
Sex      female      male
SibSp
0      0.787356  0.168203
1      0.754717  0.310680
2      0.769231  0.200000
3      0.363636  0.000000
4      0.333333  0.083333
5      0.000000  0.000000
8      0.000000  0.000000

In [73]:
age=pd.cut(train['Age'],[0,1,10,20,30,40,50,60,70,80])
train.groupby(['Pclass',age])['Survived'].mean().unstack()

Age,"(0, 1]","(1, 10]","(10, 20]","(20, 30]","(30, 40]","(40, 50]","(50, 60]","(60, 70]","(70, 80]"
Pclass,,,,,,,,,
1,1.00,0.500000,0.833333,0.725000,0.755102,0.567568,0.600000,0.181818,0.333333
2,1.00,1.000000,0.500000,0.409836,0.441860,0.526316,0.166667,0.333333,NaN
3,0.75,0.361111,0.253165,0.232558,0.206349,0.066667,0.000000,0.333333,0.000000